; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p15---int100n150-m25---int100c150---s480---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level11 level11)
(sum level0 level18 level18)
(sum level0 level25 level25)
(sum level1 level2 level3)
(sum level1 level11 level12)
(sum level1 level18 level19)
(sum level1 level25 level26)
(sum level2 level2 level4)
(sum level2 level11 level13)
(sum level2 level18 level20)
(sum level2 level25 level27)
(sum level3 level2 level5)
(sum level3 level11 level14)
(sum level3 level18 level21)
(sum level3 level25 level28)
(sum level4 level2 level6)
(sum level4 level11 level15)
(sum level4 level18 level22)
(sum level4 level25 level29)
(sum level5 level2 level7)
(sum level5 level11 level16)
(sum level5 level18 level23)
(sum level5 level25 level30)
(sum level6 level2 level8)
(sum level6 level11 level17)
(sum level6 level18 level24)
(sum level6 level25 level31)
(sum level7 level2 level9)
(sum level7 level11 level18)
(sum level7 level18 level25)
(sum level7 level25 level32)
(sum level8 level2 level10)
(sum level8 level11 level19)
(sum level8 level18 level26)
(sum level8 level25 level33)
(sum level9 level2 level11)
(sum level9 level11 level20)
(sum level9 level18 level27)
(sum level9 level25 level34)
(sum level10 level2 level12)
(sum level10 level11 level21)
(sum level10 level18 level28)
(sum level10 level25 level35)
(sum level11 level2 level13)
(sum level11 level11 level22)
(sum level11 level18 level29)
(sum level11 level25 level36)
(sum level12 level2 level14)
(sum level12 level11 level23)
(sum level12 level18 level30)
(sum level12 level25 level37)
(sum level13 level2 level15)
(sum level13 level11 level24)
(sum level13 level18 level31)
(sum level13 level25 level38)
(sum level14 level2 level16)
(sum level14 level11 level25)
(sum level14 level18 level32)
(sum level14 level25 level39)
(sum level15 level2 level17)
(sum level15 level11 level26)
(sum level15 level18 level33)
(sum level15 level25 level40)
(sum level16 level2 level18)
(sum level16 level11 level27)
(sum level16 level18 level34)
(sum level16 level25 level41)
(sum level17 level2 level19)
(sum level17 level11 level28)
(sum level17 level18 level35)
(sum level17 level25 level42)
(sum level18 level2 level20)
(sum level18 level11 level29)
(sum level18 level18 level36)
(sum level19 level2 level21)
(sum level19 level11 level30)
(sum level19 level18 level37)
(sum level20 level2 level22)
(sum level20 level11 level31)
(sum level20 level18 level38)
(sum level21 level2 level23)
(sum level21 level11 level32)
(sum level21 level18 level39)
(sum level22 level2 level24)
(sum level22 level11 level33)
(sum level22 level18 level40)
(sum level23 level2 level25)
(sum level23 level11 level34)
(sum level23 level18 level41)
(sum level24 level2 level26)
(sum level24 level11 level35)
(sum level24 level18 level42)
(sum level25 level2 level27)
(sum level25 level11 level36)
(sum level26 level2 level28)
(sum level26 level11 level37)
(sum level27 level2 level29)
(sum level27 level11 level38)
(sum level28 level2 level30)
(sum level28 level11 level39)
(sum level29 level2 level31)
(sum level29 level11 level40)
(sum level30 level2 level32)
(sum level30 level11 level41)
(sum level31 level2 level33)
(sum level31 level11 level42)
(sum level32 level2 level34)
(sum level33 level2 level35)
(sum level34 level2 level36)
(sum level35 level2 level37)
(sum level36 level2 level38)
(sum level37 level2 level39)
(sum level38 level2 level40)
(sum level39 level2 level41)
(sum level40 level2 level42)

(connected l0 l1)
(fuelcost level11 l0 l1)
(connected l0 l2)
(fuelcost level18 l0 l2)
(connected l0 l3)
(fuelcost level2 l0 l3)
(connected l1 l0)
(fuelcost level11 l1 l0)
(connected l1 l2)
(fuelcost level2 l1 l2)
(connected l1 l3)
(fuelcost level11 l1 l3)
(connected l2 l0)
(fuelcost level18 l2 l0)
(connected l2 l1)
(fuelcost level2 l2 l1)
(connected l2 l3)
(fuelcost level25 l2 l3)
(connected l3 l0)
(fuelcost level2 l3 l0)
(connected l3 l1)
(fuelcost level11 l3 l1)
(connected l3 l2)
(fuelcost level25 l3 l2)

(at t0 l3)
(fuel t0 level42)
(= (total-cost) 0)

(at p0 l0)
(at p1 l3)
(at p2 l1)
(at p3 l1)
(at p4 l3)
(at p5 l3)
(at p6 l0)
(at p7 l1)
(at p8 l1)
(at p9 l0)
(at p10 l0)
(at p11 l1)
(at p12 l1)
(at p13 l3)
(at p14 l3)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l3)
(at p3 l3)
(at p4 l0)
(at p5 l0)
(at p6 l2)
(at p7 l3)
(at p8 l3)
(at p9 l2)
(at p10 l2)
(at p11 l2)
(at p12 l2)
(at p13 l2)
(at p14 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 15
2. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 0 of 15
3. (load p14 t0 l3)
   deleted: (at p14 l3)
   added: (in p14 t0)
   goals met: 0 of 15
4. (load p13 t0 l3)
   deleted: (at p13 l3)
   added: (in p13 t0)
   goals met: 0 of 15
5. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 15
6. (drive t0 l3 l0 level40 level2 level42)
   deleted: (at t0 l3) (fuel t0 level42)
   added: (at t0 l0) (fuel t0 level40)
   goals met: 0 of 15
7. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 1 of 15
8. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 2 of 15
9. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 2 of 15
10. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 2 of 15
11. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 2 of 15
12. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 2 of 15
13. (drive t0 l0 l1 level29 level11 level40)
   deleted: (at t0 l0) (fuel t0 level40)
   added: (at t0 l1) (fuel t0 level29)
   goals met: 2 of 15
14. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 2 of 15
15. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 2 of 15
16. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 2 of 15
17. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 2 of 15
18. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 2 of 15
19. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 2 of 15
20. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 3 of 15
21. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 4 of 15
22. (drive t0 l1 l2 level27 level2 level29)
   deleted: (at t0 l1) (fuel t0 level29)
   added: (at t0 l2) (fuel t0 level27)
   goals met: 4 of 15
23. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 5 of 15
24. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 6 of 15
25. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 7 of 15
26. (unload p13 t0 l2)
   deleted: (in p13 t0)
   added: (at p13 l2)
   goals met: 8 of 15
27. (unload p14 t0 l2)
   deleted: (in p14 t0)
   added: (at p14 l2)
   goals met: 9 of 15
28. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 10 of 15
29. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 11 of 15
30. (drive t0 l2 l3 level2 level25 level27)
   deleted: (at t0 l2) (fuel t0 level27)
   added: (at t0 l3) (fuel t0 level2)
   goals met: 11 of 15
31. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 12 of 15
32. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 13 of 15
33. (unload p7 t0 l3)
   deleted: (in p7 t0)
   added: (at p7 l3)
   goals met: 14 of 15
34. (unload p8 t0 l3)
   deleted: (in p8 t0)
   added: (at p8 l3)
   goals met: 15 of 15
